# Notes on Pandas

In [2]:
import pandas as pd

years = [2020, 2021, 2021, 2022, 2023]
months = [1, 2, 9, 3, 4]
days = [5, 6, 5, 7, 8]
expenses = [1000, 1050.5, 1069.2,  980.8, 1115.6]

df = pd.DataFrame({'year': years, 'month': months, 'Tag': days, 'expenses': expenses})
df

   year  month  Tag  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
2  2021      9    5    1069.2
3  2022      3    7     980.8
4  2023      4    8    1115.6

How to select **certain columns** from **certain rows**

In [3]:
df[df['year'] == 2021][['Tag','month']]

   Tag  month
1    6      2
2    5      9

**Sort**

In [4]:
df_sorted = df.sort_values('expenses',ascending=False)
df_sorted

   year  month  Tag  expenses
4  2023      4    8    1115.6
2  2021      9    5    1069.2
1  2021      2    6    1050.5
0  2020      1    5    1000.0
3  2022      3    7     980.8

*iloc* for selecting $N^{th}$ row
(.loc would select based on index no matter what the order is)

In [5]:
df_sorted.loc[[3]]

   year  month  Tag  expenses
3  2022      3    7     980.8

In [6]:
df_sorted.iloc[[3]]

   year  month  Tag  expenses
0  2020      1    5    1000.0

Drop duplicates

In [7]:
df.drop_duplicates(subset='year', inplace = True)
df

   year  month  Tag  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
3  2022      3    7     980.8
4  2023      4    8    1115.6

Count **unique**


See more: 1693 from Leetcode

In [8]:
# grouped = daily_sales.groupby(["date_id","make_name"]).nunique().reset_index()

Rename columns

In [9]:
df.rename(columns={'Tag':'day'},inplace=True)
df

   year  month  day  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
3  2022      3    7     980.8
4  2023      4    8    1115.6

Convert column types

In [10]:
df['expenses'] = df['expenses'].round()
df['expenses'] = df['expenses'].astype(int)
df

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
3  2022      3    7       981
4  2023      4    8      1116

In [11]:
years = [2021, 2020,2023,2022,2021,2023]
months = [1, 2, 1,2,3,8]
days = [5, 6,12,32,15,24]
expenses = [1000, 1050, 2000,2100,900,850]

df2 = pd.DataFrame({'year': years, 'month': months, 'day': days, 'expenses': expenses})

Concatenating two df-s (**add new df below**)

In [12]:
df_new = pd.concat([df,df2])
df_new

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
3  2022      3    7       981
4  2023      4    8      1116
0  2021      1    5      1000
1  2020      2    6      1050
2  2023      1   12      2000
3  2022      2   32      2100
4  2021      3   15       900
5  2023      8   24       850

In [13]:
index_5 = df_new.loc[[5]]
index_5

   year  month  day  expenses
5  2023      8   24       850

Pivot table

In [14]:
df_new.pivot(index='month',columns='year',values='expenses')

year     2020    2021    2022    2023
month
1      1000.0  1000.0     NaN  2000.0
2      1050.0  1050.0  2100.0     NaN
3         NaN   900.0   981.0     NaN
4         NaN     NaN     NaN  1116.0
8         NaN     NaN     NaN   850.0

**Melt** table (reverse pivot)

In [15]:
data=[['Umbrella',417,224,279,611],['SleepingBag',800,936,93,875]]

df_sales = pd.DataFrame(data, columns=['product','quarter_1','quarter_2','quarter_3','quarter_4'])
df_sales

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        279        611
1  SleepingBag        800        936         93        875

In [16]:
df_sales.melt(id_vars=['product'],value_vars=['quarter_1','quarter_2','quarter_3','quarter_4'],var_name='quarter', value_name='sales')

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    279
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

String length + $n^{th}$ char

In [17]:
df_sales['length'] = df_sales['product'].str.len()
# df_sales['product'].str[0]
# convert to upper/lower case: .str.lower()
df_sales

       product  quarter_1  quarter_2  quarter_3  quarter_4  length
0     Umbrella        417        224        279        611       8
1  SleepingBag        800        936         93        875      11

## Reversing dictionary

In [18]:
original_dict= {1:600,
                2:500,
                3:400,
                4:300,
                5:200,
                6:100}

In [19]:
new_dict = {value: key for key, value in original_dict.items()}
new_dict

{600: 1, 500: 2, 400: 3, 300: 4, 200: 5, 100: 6}

DataFrame to Dictionary

In [26]:
employee1 = pd.DataFrame({   'id':[1,2,3,4,5,6,7,8,9],
                            'salary':[100,530,300,100,500,600,400,200,800]})

dict = pd.Series(employee1.id.values,index=employee1.salary).to_dict()
dict

{100: 4, 530: 2, 300: 3, 500: 5, 600: 6, 400: 7, 200: 8, 800: 9}

**Map** df with dict

In [21]:
employee = pd.DataFrame({   'id':[1,2,3,4,5,6,7,8,9],
                            'salary':[100,530,300,100,500,600,400,200,800]})

employee['rank'] = employee['salary'].map(new_dict)
employee

   id  salary  rank
0   1     100   6.0
1   2     530   NaN
2   3     300   4.0
3   4     100   6.0
4   5     500   2.0
5   6     600   1.0
6   7     400   3.0
7   8     200   5.0
8   9     800   NaN

## Rank df: df.rank()
see: 178. Rank Scores